<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>嚼得菜根，做得大事 | Greenwicher&#39;s Blog</title>
  <meta name="author" content="LIU Weizhi">
  
  <meta name="description" content="关于《专业投资者选股策略、方法和工具》的书评">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  <meta property="og:title" content="嚼得菜根，做得大事"/>
  <meta property="og:site_name" content="Greenwicher&#39;s Blog"/>

  
    <meta property="og:image" content="undefined"/>
  

  
    <link rel="alternative" href="/atom.xml" title="Greenwicher&#39;s Blog" type="application/atom+xml">
  
  
    <link href="/favicon.png" rel="icon">
  

  <!-- CSS -->
  <link rel="stylesheet" href="/css/themes/bootstrap.css" media="screen" type="text/css">
  <link rel="stylesheet" href="/css/font-awesome.css" media="screen" type="text/css">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <link rel="stylesheet" href="/css/responsive.css" media="screen" type="text/css">
  <link rel="stylesheet" href="/css/highlight.css" media="screen" type="text/css">
  <link rel="stylesheet" href="/css/google-fonts.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->

  <script src="/js/jquery-2.0.3.min.js"></script>
  <script src="/js/bootstrap.min.js"></script>
  <!-- analytics -->
  
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-42890116-1', 'auto');
  ga('send', 'pageview');
</script>




</head>

 <body>  
  <nav id="main-nav" class="navbar navbar-inverse navbar-default navbar-fixed-top" role="navigation">
    <div class="container">
      <button type="button" class="navbar-header navbar-toggle" data-toggle="collapse" data-target=".navbar-collapse">
	<span class="sr-only">Toggle navigation</span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
      </button>
       <a class="navbar-brand" href="http://greenwicher.com">Greenwicher&#39;s Blog</a>
      <div class="collapse navbar-collapse nav-menu">
		<ul class="nav navbar-nav">
		  
		  <li>
			<a href= "/" title="Blog homepage"> 
			  <i class="fa fa-home"></i>首页
			</a>
		  </li>
		  
		  <li>
			<a href= "/archives" title="All the articles."> 
			  <i class="fa fa-archive"></i>归档
			</a>
		  </li>
		  
		  <li>
			<a href= "/categories" title="All the categories."> 
			  <i class="fa fa-folder"></i>分类
			</a>
		  </li>
		  
		  <li>
			<a href= "/tags" title="All the tags."> 
			  <i class="fa fa-tags"></i>标签
			</a>
		  </li>
		  
		  <li>
			<a href= "/subscribe" title="Subscribe"> 
			  <i class="fa fa-rss"></i>订阅
			</a>
		  </li>
		  
		  <li>
			<a href= "https://book.douban.com/people/Greenwicher/" title="Douban"> 
			  <i class="fa fa-book"></i>读书
			</a>			
	          </li>
		  <li>
			<a href= "http://greenwicher.com/me/cv.pdf" title="Me"> 
                           <i class="fa fa-user"></i>CV 
                        </a>
                  </li>
                  <li>
			<a href= "http://greenwicher.com/me/resume-en.pdf" title="Resume"> 
                           <i class="fa fa-user"></i>Resume
			</a>		                
	          </li>
		</ul>
                <!--subscriber-->

<!-- Begin MailChimp Signup Form -->
<link href="//cdn-images.mailchimp.com/embedcode/horizontal-slim-10_7.css" rel="stylesheet" type="text/css">
<style type="text/css">
        #mc_embed_signup{background:#fff; clear:left; font:14px Helvetica,Arial,sans-serif; width:100%;}
        /* Add your own MailChimp form style overrides in your site stylesheet or in this style block.
           We recommend moving this block and the preceding CSS link to the HEAD of your HTML file. */
</style>

<form action="//greenwicher.us14.list-manage.com/subscribe/post?u=8da47f8ec088ffc8c8d5b6b88&amp;id=d8da6d2b40" method="post" id="mc-embedded-subscribe-form" name="mc-embedded-subscribe-form" class="validate" target="_blank" novalidate>
    <div id="mc_embed_signup_scroll" class="navbar-form navbar-right" role="form" >
        <input type="email" value="" name="EMAIL" class="email form-control" id="mce-EMAIL" placeholder="请输入您的邮箱" required>
        <button type="submit" class="btn btn-success">一键订阅</button>

    <!-- real people should not fill this in and expect good things - do not remove this or risk form bot signups-->
    <div style="position: absolute; left: -5000px;" aria-hidden="true"><input type="text" name="b_8da47f8ec088ffc8c8d5b6b88_d8da6d2b40" tabindex="-1" value=""></div>

    </div>

</form>



<!--End mc_embed_signup-->
<!--end of subscriber-->

      </div>
    </div> <!-- container -->
</nav>
<div class="clearfix"></div>

  <div class="container">
  	<div class="content">
    	 


	
		<div class="page-header page-header-inverse ">		
			<h1 class="title title-inverse "> 嚼得菜根，做得大事</h1>
		</div>		
	






<div class="row post">
	<!-- cols -->
	
	<div id="top_meta">
        </div>
	<div class="col-md-9">
	

	<!-- content -->
	<div class="mypage">
          <!--subscriber-->

<!-- Begin MailChimp Signup Form -->
<link href="//cdn-images.mailchimp.com/embedcode/horizontal-slim-10_7.css" rel="stylesheet" type="text/css">
<style type="text/css">
        #mc_embed_signup{background:#fff; clear:left; font:14px Helvetica,Arial,sans-serif; width:100%;}
        /* Add your own MailChimp form style overrides in your site stylesheet or in this style block.
           We recommend moving this block and the preceding CSS link to the HEAD of your HTML file. */
</style>
<div id="mc_embed_signup">
<form action="//greenwicher.us14.list-manage.com/subscribe/post?u=8da47f8ec088ffc8c8d5b6b88&amp;id=d8da6d2b40" method="post" id="mc-embedded-subscribe-form" name="mc-embedded-subscribe-form" class="validate" target="_blank" novalidate>
    <div id="mc_embed_signup_scroll">
        <label for="mce-EMAIL">一键订阅 | Greenwicher's Newsletter </label>
        <input type="email" value="" name="EMAIL" class="email" id="mce-EMAIL" placeholder="输入邮箱，为您科普 人工智能|量化交易|算法之美" required>
    <!-- real people should not fill this in and expect good things - do not remove this or risk form bot signups-->
    <div style="position: absolute; left: -5000px;" aria-hidden="true"><input type="text" name="b_8da47f8ec088ffc8c8d5b6b88_d8da6d2b40" tabindex="-1" value=""></div>
    <div class="clear"><input type="submit" value="订阅" name="subscribe" id="mc-embedded-subscribe" class="btn btn-danger"></div>
    </div>
</form>
</div>

<!--End mc_embed_signup-->
<!--end of subscriber-->

<hr>

	  
		 <div class="alert alert-success description">
			<i class="fa fa-info-circle"></i> <p>关于《专业投资者选股策略、方法和工具》的书评</p>
			
		 </div> <!-- alert -->
	  		

	  

<p>
&#x56BC;&#x5F97;&#x83DC;&#x6839;&#xFF0C;&#x505A;&#x5F97;&#x5927;&#x4E8B;&#x662F;&#x6BCD;&#x6821;&#x524D;&#x8EAB;&#x7684;&#x6821;&#x8BAD;&#x3002;&#x8FD9;&#x4E00;&#x53E5;&#x8BDD;&#x867D;&#x7136;&#x770B;&#x4F3C;&#x5F88;&#x7A7A;&#x6CDB;&#x5F88;&#x9E21;&#x6C64;&#xFF0C;&#x4F60;&#x6216;&#x8BB8;&#x4F1A;&#x8BF4;&#x8EAB;&#x4F53;&#x529B;&#x884C;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x524D;&#x8FDB;&#x7684;&#x8DEF;&#x9014;&#x4E2D;&#x4E0D;&#x65F6;&#x4F1A;&#x5FD8;&#x8BB0;&#x521D;&#x5FC3;&#xFF0C;&#x5FD8;&#x8BB0;&#x8FD9;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x771F;&#x7406;&#x3002;&#x77E5;&#x884C;&#x5408;&#x4E00;&#xFF0C;&#x4E00;&#x76F4;&#x89C9;&#x5F97;&#x5927;&#x9053;&#x81F3;&#x7B80;&#xFF0C;&#x4E0E;&#x5176;&#x4EE5;&#x6709;&#x6DAF;&#x968F;&#x65E0;&#x6DAF;&#xFF0C;&#x8017;&#x6563;&#x81EA;&#x8EAB;&#x5B9D;&#x8D35;&#x7684;&#x7CBE;&#x529B;&#x8FF7;&#x4E71;&#x4E8E;&#x5343;&#x79CD;&#x9009;&#x62E9;&#x548C;&#x7F24;&#x7EB7;&#x4FE1;&#x606F;&#xFF0C;&#x4E0D;&#x5982;&#x9009;&#x597D;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#xFF0C;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#xFF0C;&#x5BF9;&#x4EBA;&#x751F;&#x505A;&#x590D;&#x5229;&#xFF0C;&#x7EC8;&#x6210;&#x6B63;&#x679C;&#x3002;
</p>

<p>
&#x6295;&#x8D44;&#x4E5F;&#x5982;&#x6B64;&#xFF0C;&#x968F;&#x673A;&#x81F4;&#x5BCC;&#x7684;&#x50BB;&#x74DC;&#x5C11;&#x800C;&#x53C8;&#x5C11;&#xFF0C;&#x4F46;&#x9762;&#x5BF9;&#x8FD9;&#x590D;&#x6742;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x673A;&#x4F1A;&#x53EF;&#x8C13;&#x662F;&#x4F55;&#x65F6;&#x4F55;&#x5730;&#x603B;&#x4F1A;&#x6709;&#x7684;&#x3002;&#x56E0;&#x6B64;&#x8FBE;&#x5230;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x53EF;&#x80FD;&#x662F;&#x5962;&#x671B;&#xFF0C;&#x4F46;&#x5373;&#x4F7F;&#x662F;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x4E5F;&#x8DB3;&#x4EE5;&#x8BA9;&#x4F60;&#x6536;&#x83B7;&#x9887;&#x591A;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x662F;&#x6709;&#x628A;&#x63E1;&#x7684;&#x9009;&#x62E9;&#x80FD;&#x529B;&#x5708;&#x5185;&#x7684;&#x6700;&#x597D;&#x51B3;&#x7B56;&#xFF0C;&#x800C;&#x975E;&#x6361;&#x4E86;&#x829D;&#x9EBB;&#x4E22;&#x4E86;&#x897F;&#x74DC;&#x7684;&#x968F;&#x610F;&#x51B3;&#x7B56;&#x3002;&#x771F;&#x6B63;&#x7814;&#x7A76;&#x80A1;&#x7968;&#x672C;&#x8D28;&#xFF08;&#x57FA;&#x672C;&#x9762;&#xFF0C;&#x5E02;&#x573A;&#x9762;&#xFF0C;&#x65E0;&#x8C13;&#x6295;&#x8D44;&#x6216;&#x8005;&#x6295;&#x673A;&#xFF0C;&#x53EA;&#x8981;&#x5E76;&#x975E;&#x7B80;&#x5355;&#x4EA4;&#x6613;&#x63D0;&#x4F9B;&#x6D41;&#x52A8;&#x6027;&#x5C31;&#x597D;&#xFF09;&#xFF0C;&#x5373;&#x4F7F;&#x6700;&#x7EC8;&#x65E0;&#x6CD5;&#x8BA9;&#x4F60;&#x7684;&#x8D22;&#x5BCC;&#x589E;&#x957F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E30;&#x5BCC;&#x4F60;&#x7684;&#x9605;&#x5386;&#x548C;&#x89C1;&#x8BC6;&#xFF0C;&#x603B;&#x4E4B;&#x800C;&#x8A00;&#xFF0C;&#x53EF;&#x80FD;&#x8F9B;&#x82E6;&#xFF0C;&#x4F46;&#x5E76;&#x975E;&#x4E00;&#x4EF6;&#x82E6;&#x5DEE;&#x4E8B;&#x3002;&#x81F3;&#x4E8E;&#x5177;&#x4F53;&#x7684;&#x80A1;&#x7968;&#x6295;&#x8D44;&#xFF0C;&#x9009;&#x80A1;&#x9009;&#x65F6;&#x53EF;&#x8C13;&#x6700;&#x57FA;&#x672C;&#x4F46;&#x4E5F;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x51B3;&#x7B56;&#x3002;
</p>

<a id="more"></a>

<p>
&#x9009;&#x80A1;&#x65B9;&#x9762;&#xFF0C;&#x4ECE;&#x9009;&#x80A1;&#x7684;&#x6D41;&#x7A0B;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x3002;&#x4E00;&#x662F;&#x81EA;&#x4E0A;&#x800C;&#x4E0B;&#x7684;&#x9009;&#x80A1;&#xFF08;&#x8BE6;&#x89C1;&#x738B;&#x6210;&#x7684;&#x300A;&#x7B56;&#x7565;&#x6295;&#x8D44;&#x300B;&#xFF09;&#xFF0C;&#x8FD9;&#x79CD;&#x9009;&#x80A1;&#x65B9;&#x5F0F;&#x4ECE;&#x5B8F;&#x89C2;&#x7684;&#x89D2;&#x5EA6;&#x5F00;&#x59CB;&#x5206;&#x6790;&#xFF08;&#x5982;&#x4EBA;&#x53E3;&#x7ED3;&#x6784;&#x3001;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x3001;&#x7ECF;&#x6D4E;&#x589E;&#x957F;&#x3001;&#x901A;&#x8D27;&#x81A8;&#x80C0;&#x3001;&#x653F;&#x5E9C;&#x653F;&#x7B56;&#x3001;&#x56FD;&#x9645;&#x91D1;&#x878D;&#x3001;&#x5E02;&#x573A;&#x4F9B;&#x9700;&#x4E0E;&#x60C5;&#x7EEA;&#x7B49;&#x7B49;&#xFF09;&#xFF0C;&#x8FDB;&#x800C;&#x8F6C;&#x81F3;&#x5927;&#x7684;&#x5B8F;&#x89C2;&#x5BF9;&#x6574;&#x4E2A;&#x80A1;&#x7968;&#x5E02;&#x573A;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x53D7;&#x5230;&#x5B8F;&#x89C2;&#x7ECF;&#x6D4E;&#x5F71;&#x54CD;&#x7684;&#x80A1;&#x7968;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x5468;&#x671F;&#x7C7B;&#x80A1;&#x7968;&#x3001;&#x5229;&#x7387;&#x654F;&#x611F;&#x7C7B;&#x80A1;&#x7968;&#xFF1B;&#x4EBA;&#x53E3;&#x7ED3;&#x6784;&#x7684;&#x8D8B;&#x52BF;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x6D88;&#x8D39;&#x7C7B;&#x3001;&#x533B;&#x836F;&#x7C7B;&#x3001;&#x5A31;&#x4E50;&#x7C7B;&#x7684;&#x80A1;&#x7968;&#x3002;&#x5982;&#x679C;&#x5B8F;&#x89C2;&#x5C42;&#x9762;&#x770B;&#x597D;&#x7684;&#x8BDD;&#xFF0C;&#x9009;&#x62E9;&#x76F8;&#x5E94;&#x884C;&#x4E1A;&#x7684;&#x9F99;&#x5934;&#x80A1;&#x7968;&#x5373;&#x53EF;&#x76F4;&#x81F3;&#x5468;&#x671F;&#x4E0B;&#x884C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x81EA;&#x4E0A;&#x800C;&#x4E0B;&#x7684;&#x9009;&#x80A1;&#x65B9;&#x5F0F;&#x8981;&#x6C42;&#x5BF9;&#x5F53;&#x524D;&#x6240;&#x5904;&#x5468;&#x671F;&#x7684;&#x72B6;&#x6001;&#x4EE5;&#x53CA;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF0C;&#x8FDB;&#x800C;&#x9009;&#x62E9;&#x76F8;&#x5E94;&#x884C;&#x4E1A;/&#x6982;&#x5FF5;&#x6765;&#x8FDB;&#x884C;&#x6295;&#x8D44;&#x3002;&#x4F46;&#x5B8F;&#x89C2;&#x5C42;&#x9762;&#x7684;&#x5404;&#x4E2A;&#x56E0;&#x7D20;&#x53EF;&#x80FD;&#x4F1A;&#x4E92;&#x76F8;&#x77DB;&#x76FE;&#xFF0C;&#x8C01;&#x5360;&#x4E3B;&#x5BFC;&#x53EF;&#x80FD;&#x4E0D;&#x5F97;&#x800C;&#x77E5;&#xFF1B;&#x5E76;&#x4E14;&#xFF0C;&#x4E00;&#x822C;&#x5468;&#x671F;&#x53D8;&#x5316;&#x90FD;&#x4F1A;&#x8F83;&#x957F;&#xFF0C;&#x5165;&#x95E8;&#x6295;&#x8D44;&#x8005;&#x5F88;&#x96BE;&#x7ECF;&#x5386;&#x5B8C;&#x6574;&#x7684;&#x6295;&#x8D44;&#x5468;&#x671F;&#xFF0C;&#x56E0;&#x800C;&#x7F3A;&#x4E4F;&#x76F8;&#x5173;&#x7ECF;&#x9A8C;&#x3002;
</p>

<p>
&#x56E0;&#x6B64;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x9009;&#x80A1;&#x65B9;&#x5F0F;&#xFF0C;&#x81EA;&#x4E0B;&#x800C;&#x4E0A;&#x7684;&#x9009;&#x80A1;&#x76F8;&#x5BF9;&#x800C;&#x8A00;&#x66F4;&#x9002;&#x7528;&#x4E8E;&#x5404;&#x4E2A;&#x65F6;&#x671F;&#x5404;&#x79CD;&#x6295;&#x8D44;&#x8005;&#x7684;&#x80FD;&#x529B;&#x3002;&#x81EA;&#x4E0B;&#x800C;&#x4E0A;&#x7684;&#x9009;&#x80A1;&#x5206;&#x4E24;&#x4E2A;&#x5C42;&#x9762;&#xFF0C;&#x9996;&#x5148;&#xFF0C;&#x5206;&#x6790;&#x516C;&#x53F8;&#xFF08;&#x57FA;&#x672C;&#x9762;&#xFF09;&#xFF0C;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x516C;&#x53F8;&#x7684;&#x7ADE;&#x4E89;&#x4F18;&#x52BF;&#x548C;&#x6210;&#x957F;&#x7A7A;&#x95F4;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x662F;&#x597D;&#x516C;&#x53F8;&#xFF1B;&#x5176;&#x6B21;&#xFF0C;&#x5206;&#x6790;&#x80A1;&#x7968;&#xFF08;&#x6295;&#x8D44;&#x9762;&#xFF09;&#xFF0C;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x80A1;&#x7968;&#x662F;&#x5426;&#x5B58;&#x5728;&#x5B89;&#x5168;&#x8FB9;&#x9645;&#x4EE5;&#x53CA;&#x80A1;&#x6027;&#xFF08;&#x53CD;&#x6620;&#x80A1;&#x7968;&#x6CE2;&#x52A8;&#x6027;&#xFF09;&#x6765;&#x5224;&#x65AD;&#x5F53;&#x524D;&#x662F;&#x5426;&#x662F;&#x597D;&#x80A1;&#x7968;&#x3002;&#x5177;&#x4F53;&#x800C;&#x8A00;&#xFF0C;&#x4E09;&#x7C7B;&#x516C;&#x53F8;&#x4E0E;&#x80A1;&#x7968;&#x5206;&#x6790;&#x7684;&#x6DF7;&#x5408;&#x4F53;&#xFF0C;&#x4E1A;&#x7EE9;&#x590D;&#x82CF;&#x7C7B;&#x3001;&#x9AD8;&#x901F;&#x6210;&#x957F;&#x7C7B;&#x3001;&#x70ED;&#x95E8;&#x52A8;&#x91CF;&#x7C7B;&#x662F;&#x8868;&#x73B0;&#x6700;&#x597D;&#x7684;&#x4E09;&#x7C7B;&#x80A1;&#x7968;&#xFF08;&#x53EF;&#x89C1;&#x4F5C;&#x8005;&#x6DF1;&#x53D7;&#x6210;&#x957F;&#x6295;&#x8D44;&#x7684;&#x5F71;&#x54CD;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x81EA;&#x4E0B;&#x800C;&#x4E0A;&#x7684;&#x9009;&#x80A1;&#x65B9;&#x5F0F;&#x7684;&#x96BE;&#x70B9;&#x662F;&#x7B5B;&#x9009;&#x51FA;&#x4E09;&#x7C7B;&#x660E;&#x661F;&#x80A1;&#x7968;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x6790;&#x5176;&#x57FA;&#x672C;&#x9762;&#xFF08;&#x516C;&#x53F8;&#x672C;&#x8EAB;&#xFF0C;&#x884C;&#x4E1A;&#x672C;&#x8EAB;&#xFF0C;&#x751A;&#x81F3;&#x518D;&#x4E0E;&#x56FD;&#x5916;&#x5E02;&#x573A;&#x5BF9;&#x6BD4;&#xFF09;&#x4E0E;&#x6295;&#x8D44;&#x9762;&#x662F;&#x5426;&#x9002;&#x5B9C;&#x3002;
</p>

<p>
&#x9009;&#x65F6;&#x65B9;&#x9762;&#x4F5C;&#x8005;&#x4ECB;&#x7ECD;&#x7684;&#x76F8;&#x5BF9;&#x5C11;&#x4E00;&#x4E9B;&#xFF0C;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#x9488;&#x5BF9;&#x5236;&#x9020;&#x7C7B;&#x4F01;&#x4E1A;&#x7684;&#x8D39;&#x96EA;&#x4E70;&#x70B9;&#x3002;&#x4F46;&#x666E;&#x4E16;&#x7684;&#x9009;&#x65F6;&#x65B9;&#x5F0F;&#xFF0C;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x53EF;&#x4EE5;&#x9996;&#x5148;&#x5206;&#x6790;&#x5E02;&#x573A;&#x60C5;&#x7EEA;&#xFF0C;&#x5927;&#x81F4;&#x5224;&#x65AD;&#x6DA8;&#x8DCC;&#x7684;&#x6982;&#x7387;&#xFF1B;&#x518D;&#x7ED3;&#x5408;&#x57FA;&#x672C;&#x9762;&#xFF0C;&#x786E;&#x8BA4;&#x5B89;&#x5168;&#x8FB9;&#x9645;&#x662F;&#x5426;&#x59A5;&#x5F53;&#x3002;&#x5982;&#x679C;&#xFF0C;&#x4E00;&#x5207;&#x987A;&#x5229;&#x7684;&#x8BDD;&#xFF0C;&#x4FBF;&#x4E70;&#x5165;&#xFF0C;&#x7B49;&#x5F85;&#x5E76;&#x5173;&#x6CE8;&#x516C;&#x53F8;&#x57FA;&#x672C;&#x9762;&#x60C5;&#x51B5;&#x76F4;&#x5230;&#x5047;&#x8BBE;&#x903B;&#x8F91;&#x4E0D;&#x5728;&#x518D;&#x5356;&#x51FA;&#x80A1;&#x7968;&#x3002;
</p>

<p>
&#x672C;&#x4EBA;&#x7406;&#x5DE5;&#x79D1;&#x51FA;&#x8EAB;&#xFF0C;&#x4EE5;&#x524D;&#x7684;&#x6295;&#x8D44;&#x60F3;&#x6CD5;&#x4FBF;&#x662F;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x5386;&#x53F2;&#x6570;&#x636E;&#xFF0C;&#x6784;&#x5EFA;&#x5404;&#x79CD;&#x6307;&#x6807;&#x4E3A;&#x6295;&#x8D44;&#x4FE1;&#x53F7;&#x3002;&#x4F46;&#x540E;&#x6765;&#x89C9;&#x5F97;&#x5B81;&#x8981;&#x6A21;&#x7CCA;&#x7684;&#x51C6;&#x786E;&#xFF0C;&#x52FF;&#x8981;&#x7CBE;&#x786E;&#x7684;&#x9519;&#x8BEF;&#x5176;&#x5B9E;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x6A21;&#x578B;&#x5F88;&#x96BE;&#x987E;&#x53CA;&#x5230;&#x5404;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x56E0;&#x800C;&#x654F;&#x611F;&#x6027;&#x5F88;&#x5927;&#xFF0C;&#x800C;&#x4EBA;&#x7684;&#x4F18;&#x52BF;&#x5728;&#x4E8E;&#x80FD;&#x591F;&#x6709;&#x628A;&#x63E1;&#x7684;&#x628A;&#x63E1;&#x6838;&#x5FC3;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x8BDD;&#x867D;&#x5982;&#x6B64;&#xFF0C;&#x5B9A;&#x91CF;&#x5316;&#x7684;&#x6307;&#x6807;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x8F85;&#x52A9;&#x7684;&#x4F9D;&#x636E;&#x3002;&#x4F46;&#x5982;&#x4F55;&#x83B7;&#x5F97;&#x5B9A;&#x91CF;&#x5316;&#x7684;&#x6307;&#x6807;&#x5374;&#x662F;&#x4E2A;&#x4E3B;&#x89C2;&#x4F46;&#x53C8;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x300E;&#x522B;&#x4EBA;&#x6050;&#x60E7;&#x65F6;&#x6211;&#x8D2A;&#x5A6A;&#xFF0C;&#x522B;&#x4EBA;&#x8D2A;&#x5A6A;&#x65F6;&#x6211;&#x6050;&#x60E7;&#x300F;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x8861;&#x91CF;&#x8D2A;&#x5A6A;&#x6216;&#x8005;&#x6050;&#x60E7;&#xFF1F;&#x5047;&#x8BBE;&#x6D4B;&#x91CF;&#x51FA;&#x6050;&#x60E7;&#x6216;&#x8D2A;&#x5A6A;&#x4E4B;&#x540E;&#xFF0C;&#x5982;&#x4F55;&#x4E0E;&#x4EE5;&#x5F80;&#x7684;&#x5386;&#x53F2;&#x5BF9;&#x6BD4;&#xFF0C;&#x800C;&#x8BF4;&#x660E;&#x5F53;&#x524D;&#x60C5;&#x7EEA;&#x7684;&#x5267;&#x70C8;&#x7A0B;&#x5EA6;&#xFF1F;
</p>

<p>
&#x9664;&#x4E86;&#xFF0C;&#x9009;&#x80A1;&#x9009;&#x65F6;&#x4E4B;&#x5916;&#xFF0C;&#x4ED3;&#x4F4D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4FE1;&#x5FF5;&#x7684;&#x6784;&#x5EFA;&#x4E5F;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x6295;&#x8D44;&#x8981;&#x7D20;&#x3002;
</p>


          <p class="bg-warning"><a href="http://creativecommons.org/licenses/by/2.5/cn/" target="_blank" rel="external"><a href="http://i.creativecommons.org/l/by/2.5/cn/88x31.png" title="知识共享许可协议" rel="fancy-group" class="fancy-ctn fancybox"><img src="http://i.creativecommons.org/l/by/2.5/cn/88x31.png" title="知识共享许可协议"></a></a>本作品采用<a href="http://creativecommons.org/licenses/by/2.5/cn/" target="_blank" rel="external">知识共享署名 2.5 中国大陆许可协议</a>进行许可。欢迎转载，但请注明来自<a href="http://greenwicher.github.io/" target="_blank" rel="external">Mount Greenwicher</a>的文章<a href="http://blog.greenwicher.com/2014/12/03/嚼得菜根，做得大事/index.html">《嚼得菜根，做得大事》</a>，并保持转载后文章内容的完整与无歧义。本人保留所有版权相关权利。</p>
        <!--subscriber-->

<!-- Begin MailChimp Signup Form -->
<link href="//cdn-images.mailchimp.com/embedcode/horizontal-slim-10_7.css" rel="stylesheet" type="text/css">
<style type="text/css">
        #mc_embed_signup{background:#fff; clear:left; font:14px Helvetica,Arial,sans-serif; width:100%;}
        /* Add your own MailChimp form style overrides in your site stylesheet or in this style block.
           We recommend moving this block and the preceding CSS link to the HEAD of your HTML file. */
</style>
<div id="mc_embed_signup">
<form action="//greenwicher.us14.list-manage.com/subscribe/post?u=8da47f8ec088ffc8c8d5b6b88&amp;id=d8da6d2b40" method="post" id="mc-embedded-subscribe-form" name="mc-embedded-subscribe-form" class="validate" target="_blank" novalidate>
    <div id="mc_embed_signup_scroll">
        <label for="mce-EMAIL">一键订阅 | Greenwicher's Newsletter </label>
        <input type="email" value="" name="EMAIL" class="email" id="mce-EMAIL" placeholder="输入邮箱，为您科普 人工智能|量化交易|算法之美" required>
    <!-- real people should not fill this in and expect good things - do not remove this or risk form bot signups-->
    <div style="position: absolute; left: -5000px;" aria-hidden="true"><input type="text" name="b_8da47f8ec088ffc8c8d5b6b88_d8da6d2b40" tabindex="-1" value=""></div>
    <div class="clear"><input type="submit" value="订阅" name="subscribe" id="mc-embedded-subscribe" class="btn btn-danger"></div>
    </div>
</form>
</div>

<!--End mc_embed_signup-->
<!--end of subscriber-->

<hr>

	</div>
        
        <!--Donate-->
          <style type="text/css">
            #rewardButton{cursor:pointer;border:0;outline:0;border-radius:100%;padding:0;margin:0;letter-spacing:normal;text-transform:none;text-indent:0px;text-shadow:none;}
            #rewardButton span{display:inline-block;width:80px;height:25px;border-radius:5px;color:#fff;font-weight:400;font-style:normal;font-variant:normal;font-stretch:normal;font-size:18px;font-family:"Microsoft Yahei";background:#f44336;}
            #rewardButton span:hover{background:#f7877f;}#QR{padding-top:20px;}#QR a{border:0;}#QR img{width:180px;max-width:100%;display:inline-block;margin:0.8em 2em 0 2em;}#wechat:hover p{animation:roll 0.1s infinite linear;-webkit-animation:roll 0.1s infinite linear;-moz-animation:roll 0.1s infinite linear;}#alipay:hover p{animation:roll 0.1s infinite linear;-webkit-animation:roll 0.1s infinite linear;-moz-animation:roll 0.1s infinite linear;}
            @-moz-keyframes roll{from{-webkit-transform:rotateZ(30deg);-moz-transform:rotateZ(30deg);-ms-transform:rotateZ(30deg);-o-transform:rotateZ(30deg);transform:rotateZ(30deg);}to{-webkit-transform:rotateZ(-30deg);-moz-transform:rotateZ(-30deg);-ms-transform:rotateZ(-30deg);-o-transform:rotateZ(-30deg);transform:rotateZ(-30deg);}}@-webkit-keyframes roll{from{-webkit-transform:rotateZ(30deg);-moz-transform:rotateZ(30deg);-ms-transform:rotateZ(30deg);-o-transform:rotateZ(30deg);transform:rotateZ(30deg);}to{-webkit-transform:rotateZ(-30deg);-moz-transform:rotateZ(-30deg);-ms-transform:rotateZ(-30deg);-o-transform:rotateZ(-30deg);transform:rotateZ(-30deg);}}@-o-keyframes roll{from{-webkit-transform:rotateZ(30deg);-moz-transform:rotateZ(30deg);-ms-transform:rotateZ(30deg);-o-transform:rotateZ(30deg);transform:rotateZ(30deg);}to{-webkit-transform:rotateZ(-30deg);-moz-transform:rotateZ(-30deg);-ms-transform:rotateZ(-30deg);-o-transform:rotateZ(-30deg);transform:rotateZ(-30deg);}}@keyframes roll{from{-webkit-transform:rotateZ(30deg);-moz-transform:rotateZ(30deg);-ms-transform:rotateZ(30deg);-o-transform:rotateZ(30deg);transform:rotateZ(30deg);}to{-webkit-transform:rotateZ(-30deg);-moz-transform:rotateZ(-30deg);-ms-transform:rotateZ(-30deg);-o-transform:rotateZ(-30deg);transform:rotateZ(-30deg);}}
        </style>
        
        <div>
          <div style="padding: 10px 0; margin: 20px auto; width: 90%; text-align: center;">
            <div>据说爱打赏的人运气都不会差</div>
            <button id="rewardButton" disable="enable" onclick="var qr = document.getElementById('QR'); if (qr.style.display === 'none') {qr.style.display='block';} else {qr.style.display='none'}">
              <span>谢主隆恩</span>
            </button>
            <div id="QR" style="display: block;">
              <div id="wechat" style="display: inline-block">
                <a href="" class="fancybox" rel="group"><img id="wechat_qr" src="/imgs/wechatpay.PNG"></a>
                <p>微信打赏</p>
              </div>
              <div id="wechat" style="display: inline-block">
                <a href="" class="fancybox" rel="group"><img id="alipay_qr" src="/imgs/alipay.PNG"></a>
                <p>支付宝打赏</p>
              </div>              
            </div>
          </div>
        </div>
        <!--End of Donate-->

        <!--Adsense-->
        <div class="widget tag">
<script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<!-- 文末横幅 -->
<ins class="adsbygoogle"
     style="display:block"
     data-ad-client="ca-pub-4230509553120128"
     data-ad-slot="1153059496"
     data-ad-format="auto"></ins>
<script>
(adsbygoogle = window.adsbygoogle || []).push({});
</script>
</div>

        <!--End of Adsense-->


	<div>
  	<center>
	<div class="pagination">
<ul class="pagination">
	 
				
    	<li class="prev"><a href="/2014/12/06/神奇公式，并不神奇/" class="alignleft prev"><i class="fa fa-arrow-circle-o-left"></i>上一页</a></li>
  		

        <li><a href="/"><i class="fa fa-archive"></i>首页</a></li>

		
		   <li class="next"><a href="/2014/03/02/毕设开题不会写，怎么破？快试试BiblioPy吧！/" class="alignright next">下一页<i class="fa fa-arrow-circle-o-right"></i></a></li>         
        
	
</ul>
</div>

    </center>
	</div>

    <!-- share -->
    
        
    <div class="bdsharebuttonbox">
        <a href="#" class="bds_more" data-cmd="more"></a>
        <a href="#" class="bds_weixin" data-cmd="weixin" title="分享到微信"></a>
        <a href="#" class="bds_tsina" data-cmd="tsina" title="分享到新浪微博"></a>
        <a href="#" class="bds_fbook" data-cmd="fbook" title="分享到Facebook"></a>
        <a href="#" class="bds_twi" data-cmd="twi" title="分享到Twitter"></a>
        <a href="#" class="bds_linkedin" data-cmd="linkedin" title="分享到linkedin"></a>
        <a href="#" class="bds_evernotecn" data-cmd="evernotecn" title="分享到印象笔记"></a>
        <a href="#" class="bds_youdao" data-cmd="youdao" title="分享到有道云笔记"></a>
        <a href="#" class="bds_copy" data-cmd="copy" title="分享到复制网址"></a>
    </div>
    <script>
        window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"2","bdMiniList":false,"bdPic":"","bdStyle":"1","bdSize":"24"},"share":{}};
        with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];
    </script>


        

    
	
	<!-- comment -->
	
<section id="comment">
  <h2 class="title">留言</h2>

  
  	 <div class="ds-thread" data-thread-key="2014/12/03/嚼得菜根，做得大事/" data-title="嚼得菜根，做得大事" data-url="http://blog.greenwicher.com/2014/12/03/嚼得菜根，做得大事/"></div>  
  
</section>

	</div> <!-- col-md-9/col-md-12 -->
		
	
	<div id="side_meta">
           <span id="busuanzi_container_page_pv">
             新大陆被发现了<span id="busuanzi_value_page_pv" class="badge badge-success"></span>次！
          </span>

		<div class="col-md-3 scrollspy" id="post_meta"> 
	<!-- date -->
	
	<div class="meta-widget">
	<i class="fa fa-clock-o"></i>
	Dec 3 2014 
	</div>
	

	<!-- categories -->
    
	<div class="meta-widget">
	<a data-toggle="collapse" data-target="#categorys"><i class="fa fa-folder"></i></a>	
    <ul id="categorys" class="tag_box list-unstyled collapse in">
          
  <li>
    <li><a href="/categories/如何做投资/">如何做投资<span>2</span></a></li>
  </li>

    </ul>
	</div>
	

	<!-- tags -->
	
	<div id="tagsblock" class="meta-widget">
	<a data-toggle="collapse" data-target="#tags"><i class="fa fa-tags"></i></a>		  
    <ul id="tags" class="tag_box list-unstyled collapse in">	  
	    
  <li><a href="/tags/书评/">书评<span>2</span></a></li> <li><a href="/tags/投资/">投资<span>2</span></a></li>
    </ul>
	</div>
		

	<!-- toc -->
        <script type="text/javascript">
        $(document).ready(function(){
          $("#tocaffix").affix({
            offset: { 
              top: $("#tagsblock").offset().top
            }
          });
        });
        </script>

        <style>
          .affix{position:fixed;top:40px;}
          .affix-bottom{position:absolute;}
        </style>
        
	<div id="tocaffix" class="meta-widget affix-top">
        <!--<div class="meta-widget">-->
	
	   <a data-toggle="collapse" data-target="#toc"><i class="fa fa-bars"></i></a>
	   <div id="toc" class="toc collapse in">
			
		</div>
	
	</div>



	
    <hr>
	
</div><!-- col-md-3 -->

	</div>
		

</div><!-- row -->

<script type="text/javascript">
  var duoshuoQuery = { short_name: 'greenwicher' };
  (function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';
    ds.async = true;
    ds.src = 'http://static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
</script>





	</div>
  </div>
  <div class="container-narrow">
  <footer> <p>
  &copy; 2017 LIU Weizhi
  
      with help from <a href="http://hexo.io/" target="_blank">Hexo</a> and <a href="http://getbootstrap.com/" target="_blank">Twitter Bootstrap</a>. Theme by <a href="http://github.com/wzpan/hexo-theme-freemind/">Freemind</a>.
</br>
本站共迎来了<span id="busuanzi_value_site_uv"></span>个小伙伴，总计<span id="busuanzi_value_site_pv"></span>次站点流量.

</p>

<script async src="//dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js">
</script>
 </footer>
</div> <!-- container-narrow -->
  


  
<a id="gotop" href="#">   
  <span>▲</span> 
</a>

<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/bootstrap.min.js"></script>
<script src="/js/main.js"></script>
<script src="/js/search.js"></script> 


<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();
})(jQuery);
</script>



   <script type="text/javascript">      
     var search_path = "search.xml";
	 if (search_path.length == 0) {
	 	search_path = "search.xml";
	 }
	 var path = "/" + search_path;
     searchFunc(path, 'local-search-input', 'local-search-result');
   </script>



<!-- UJian Button BEGIN -->
<script type="text/javascript" src="http://v1.ujian.cc/code/ujian.js?type=slide&fade=1&uid=2123572"></script>
<a href="http://www.ujian.cc" style="border:0;"><img src="http://img.ujian.cc/pixel.png" alt="友荐云推荐" style="border:0;padding:0;margin:0;" /></a>
<!-- UJian Button END -->
<script type="text/x-mathjax-config">
    MathJax.Hub.Config({
        tex2jax: {
            inlineMath: [ ["$","$"], ["\\(","\\)"] ],
            skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code'],
            processEscapes: true
        }
    });
    MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax();
        for (var i = 0; i < all.length; ++i)
            all[i].SourceElement().parentNode.className += ' has-jax';
    });
</script>
<script src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
</body>
   </html>
