<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>工欲善其事，必先利其器 | Greenwicher&#39;s Blog</title>
  <meta name="author" content="LIU Weizhi">
  
  <meta name="description" content="本文参加了『利器社群计划』，着重推荐了本人重度使用的工具库以及多年来总结出的工作流">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  <meta property="og:title" content="工欲善其事，必先利其器"/>
  <meta property="og:site_name" content="Greenwicher&#39;s Blog"/>

  
    <meta property="og:image" content="undefined"/>
  

  
    <link rel="alternative" href="/atom.xml" title="Greenwicher&#39;s Blog" type="application/atom+xml">
  
  
    <link href="/favicon.png" rel="icon">
  

  <!-- CSS -->
  <link rel="stylesheet" href="/css/themes/bootstrap.css" media="screen" type="text/css">
  <link rel="stylesheet" href="/css/font-awesome.css" media="screen" type="text/css">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <link rel="stylesheet" href="/css/responsive.css" media="screen" type="text/css">
  <link rel="stylesheet" href="/css/highlight.css" media="screen" type="text/css">
  <link rel="stylesheet" href="/css/google-fonts.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->

  <script src="/js/jquery-2.0.3.min.js"></script>

  <!-- analytics -->
  
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-42890116-1', 'auto');
  ga('send', 'pageview');
</script>




</head>

 <body>  
  <nav id="main-nav" class="navbar navbar-inverse navbar-default navbar-fixed-top" role="navigation">
    <div class="container">
      <button type="button" class="navbar-header navbar-toggle" data-toggle="collapse" data-target=".navbar-collapse">
	<span class="sr-only">Toggle navigation</span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
      </button>
       <a class="navbar-brand" href="http://greenwicher.com">Greenwicher&#39;s Blog</a>
      <div class="collapse navbar-collapse nav-menu">
		<ul class="nav navbar-nav">
		  
		  <li>
			<a href= "/" title="Blog homepage"> 
			  <i class="fa fa-home"></i>首页
			</a>
		  </li>
		  
		  <li>
			<a href= "/archives" title="All the articles."> 
			  <i class="fa fa-archive"></i>归档
			</a>
		  </li>
		  
		  <li>
			<a href= "/categories" title="All the categories."> 
			  <i class="fa fa-folder"></i>分类
			</a>
		  </li>
		  
		  <li>
			<a href= "/tags" title="All the tags."> 
			  <i class="fa fa-tags"></i>标签
			</a>
		  </li>
		  
		  <li>
			<a href= "/atom.xml" title="RSS Subscription"> 
			  <i class="fa fa-rss"></i>RSS
			</a>
		  </li>
		  
		  <li>
			<a href= "https://book.douban.com/people/Greenwicher/" title="Douban"> 
			  <i class="fa fa-book"></i>读书
			</a>			
	          </li>
		  <li>
			<a href= "http://greenwicher.com/me/cv.pdf" title="Me"> 
			  <i class="fa fa-user"></i>关于我
			</a>			
	          </li>
		</ul>
      </div>
    </div> <!-- container -->
</nav>
<div class="clearfix"></div>

  <div class="container">
  	<div class="content">
    	 


	
		<div class="page-header page-header-inverse ">		
			<h1 class="title title-inverse "> 工欲善其事，必先利其器</h1>
		</div>		
	






<div class="row post">
	<!-- cols -->
	
	<div id="top_meta">
        </div>
	<div class="col-md-9">
	

	<!-- content -->
	<div class="mypage">		
	  
		 <div class="alert alert-success description">
			<i class="fa fa-info-circle"></i> <p>本文参加了『利器社群计划』，着重推荐了本人重度使用的工具库以及多年来总结出的工作流</p>
			
		 </div> <!-- alert -->
	  		

	  

<p>
&#x672C;&#x6587;&#x53C2;&#x4E0E;&#x4E86;&#x300C;&#x5229;&#x5668;&#x793E;&#x7FA4;&#x8BA1;&#x5212;&#x300D;&#xFF0C;&#x53D1;&#x73B0;&#x66F4;&#x591A;&#x521B;&#x9020;&#x8005;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x5177;&#xFF1A;<a href="http://liqi.io/community/" target="_blank" rel="external">http://liqi.io/community/</a> &#xFF0C;&#x7740;&#x91CD;&#x63A8;&#x8350;&#x4E86;&#x672C;&#x4EBA;&#x91CD;&#x5EA6;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x5E93;&#x4EE5;&#x53CA;&#x591A;&#x5E74;&#x6765;&#x603B;&#x7ED3;&#x51FA;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x4E5F;&#x63A2;&#x8BA8;&#x4E86;&#x6211;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x8F6C;&#x6298;&#x70B9;&#x3001;&#x6700;&#x7406;&#x60F3;&#x7684;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x4EE5;&#x53CA;&#x5E73;&#x65F6;&#x83B7;&#x5F97;&#x5DE5;&#x4F5C;&#x7075;&#x611F;&#x7684;&#x4E00;&#x4E9B;&#x65B9;&#x5F0F;&#x3002;
</p>

<a id="more"></a>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x4F60;&#x81EA;&#x5DF1;&#x548C;&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</h2>
<div class="outline-text-2" id="text-1">
<p>
&#x5927;&#x5BB6;&#x597D;&#xFF01;&#x6211;&#x662F;&#x5218;&#x5A01;&#x5FD7;&#xFF0C;&#x5178;&#x578B;&#x7684;&#x6469;&#x7FAF;&#x5EA7;&#xFF0C;&#x7565;&#x5E26;&#x6709;&#x5B8C;&#x7F8E;&#x4E3B;&#x4E49;&#x60C5;&#x7ED3;&#xFF08;&#x5BFC;&#x81F4;&#x60F3;&#x5F97;&#x591A;&#x3001;&#x505A;&#x7684;&#x5C11;&#xFF09;&#xFF0C;&#x5E76;&#x60A3;&#x6709;&#x91CD;&#x5EA6;&#x677E;&#x9F20;&#x75C7;&#xFF08;&#x5982;&#x679C;&#x4F60;&#x627E;&#x5230;&#x4E86;&#x836F;&#xFF0C;&#x8BF7;&#x544A;&#x8BC9;&#x6211;&#xFF09;&#x3002;&#x76EE;&#x524D;&#x5728;&#x65B0;&#x52A0;&#x5761;&#x56FD;&#x7ACB;&#x5927;&#x5B66;&#x653B;&#x8BFB;&#x535A;&#x58EB;&#x5B66;&#x4F4D;&#xFF0C;&#x7814;&#x7A76;&#x65B9;&#x5411;&#x662F;&#x4EFF;&#x771F;&#x4F18;&#x5316;&#xFF08;<a href="https://en.wikipedia.org/wiki/Simulation-based_optimization" target="_blank" rel="external">simulation optimization</a>&#xFF09;&#x3002;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#xFF0C;&#x60F3;&#x628A;&#x7B97;&#x6CD5;&#x4E0E;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3001;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x3001;&#x4EE5;&#x53CA;&#x91CF;&#x5316;&#x4EA4;&#x6613;&#x8FD9;&#x4E09;&#x5927;&#x9886;&#x57DF;&#x7684;&#x6280;&#x80FD;&#x6811;&#x5168;&#x90E8;&#x70B9;&#x4EAE;&#xFF0C;&#x4F46;&#x8DEF;&#x6F2B;&#x6F2B;&#x5176;&#x4FEE;&#x8FDC;&#x516E;&#x3002;
  <div class="figure"><p><center><img src="nus.jpg" alt="nus.jpg" width=" 80%"><figcaption>nus.jpg</figcaption></center></p></div> 
&#x5F88;&#x591A;&#x4EBA;&#x95EE;&#x6211;&#xFF0C;&#x7A76;&#x7ADF;&#x5177;&#x4F53;&#x4EFF;&#x771F;&#x4EC0;&#x4E48;&#xFF0C;&#x662F;&#x7269;&#x6D41;&#x7CFB;&#x7EDF;&#xFF1F;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;&#xFF1F;&#x8FD8;&#x662F;&#x91D1;&#x878D;&#x7CFB;&#x7EDF;&#xFF1F;&#x5176;&#x5B9E;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5177;&#x4F53;&#x7684;&#x5E94;&#x7528;&#x6807;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x4EFF;&#x771F;&#x4F18;&#x5316;&#x7406;&#x89E3;&#x4E3A;&#x5B58;&#x5728;&#x968F;&#x673A;&#x6270;&#x52A8;&#x4E0B;&#x7684;&#x7EBF;&#x6027;&#x89C4;&#x5212;&#x3001;&#x51F8;&#x4F18;&#x5316;&#x6216;&#x8005;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x672C;&#x8D28;&#x8FD8;&#x662F;&#x8FFD;&#x6C42;&#x7406;&#x8BBA;&#x4E0A;&#x7684;&#x7A81;&#x7834;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x7AE5;&#x978B;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x591A;&#x81C2;&#x8D4C;&#x535A;&#x673A;&#x95EE;&#x9898;&#xFF08;<a href="https://en.wikipedia.org/wiki/Multi-armed_bandit" target="_blank" rel="external">multi-armed bandit problems</a>&#xFF09;&#xFF1B;&#x7EDF;&#x8BA1;&#x7684;&#x7AE5;&#x978B;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x8BD5;&#x9A8C;&#x8BBE;&#x8BA1;&#xFF08;<a href="https://en.wikipedia.org/wiki/Design_of_experiments" target="_blank" rel="external">design of experiments</a>&#xFF09;&#xFF1B;&#x8FD0;&#x7B79;&#x5B66;&#x7684;&#x7AE5;&#x978B;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x968F;&#x673A;&#x89C4;&#x5212;&#xFF08;<a href="https://en.wikipedia.org/wiki/Stochastic_programming" target="_blank" rel="external">stochastic programming</a>&#xFF09;&#x3002;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x5177;&#x4F53;&#x5230;&#x4EFF;&#x771F;&#x4F18;&#x5316;&#x9886;&#x57DF;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#x662F;&#x7528;&#x9AD8;&#x6548;&#x7684;&#x4EFF;&#x771F;&#x6765;&#x89E3;&#x51B3;&#x968F;&#x673A;&#x4F18;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x6B64;&#x9996;&#x5148;&#x8981;&#x89E3;&#x51B3;&#x9AD8;&#x6548;&#x4EFF;&#x771F;&#xFF0C;&#x5176;&#x6B21;&#x662F;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x4EFF;&#x771F;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x8F85;&#x52A9;&#x4F18;&#x5316;&#x51B3;&#x7B56;&#x3002;
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">&#x4F60;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x7684;&#x8F6C;&#x6298;&#x70B9;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h2>
<div class="outline-text-2" id="text-2">
<p>
&#x5982;&#x679C;&#x987A;&#x5229;&#x7684;&#x8BDD;&#xFF0C;&#x518D;&#x8FC7;&#x4E00;&#x4E24;&#x5E74;&#xFF0C;&#x6211;&#x8FD9;&#x4E3A;&#x671F;&#x8FD1;&#x4E8C;&#x5341;&#x591A;&#x5E74;&#x7684; <code>&#x804C;&#x4E1A;&#x5B66;&#x751F;&#x751F;&#x6DAF;</code> &#x5C31;&#x5C06;&#x544A;&#x4E00;&#x6BB5;&#x843D;&#xFF0C;&#x8FCE;&#x6765;&#x65B0;&#x7684;&#x8F6C;&#x6298;&#x70B9;&#x3002;&#x4F46;&#x672A;&#x6765;&#x8FD8;&#x5F88;&#x9065;&#x8FDC;&#xFF0C;&#x4EBA;&#x751F;&#x4E5F;&#x5F88;&#x6F2B;&#x957F;&#xFF0C;&#x5E0C;&#x671B;&#x63A5;&#x8FDE;&#x4E0D;&#x65AD;&#x7684;&#x8F6C;&#x6298;&#x70B9;&#x80FD;&#x591F;&#x8BA9;&#x6211;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#xFF0C;&#x4E5F;&#x8BA9;&#x6211;&#x80FD;&#x591F;&#x4FDD;&#x62A4;&#x6211;&#x6240;&#x5728;&#x4E4E;&#x7684;&#x4EBA;&#x5E76;&#x5B9E;&#x73B0;&#x8D22;&#x5BCC;&#x81EA;&#x7531;&#x3002;&#x524D;&#x4E8C;&#x5341;&#x591A;&#x5E74;&#x7684;&#x4EBA;&#x751F;&#xFF0C;&#x8EAB;&#x4E3A;&#x5B66;&#x751F;&#xFF0C;&#x4E5F;&#x4E0D;&#x514D;&#x5E73;&#x6DE1;&#xFF0C;&#x4F46;&#x4E5F;&#x786E;&#x5B9E;&#x6709;&#x8BB8;&#x591A;&#x5F71;&#x54CD;&#x4E86;&#x6211;&#x4EBA;&#x751F;&#x8F68;&#x8FF9;&#x7684;&#x8F6C;&#x6298;&#x70B9;&#xFF0C;&#x5370;&#x8C61;&#x6700;&#x6DF1;&#x7684;&#x4FBF;&#x662F;2013&#x5E74;&#x7684;&#x7F8E;&#x56FD;&#x5927;&#x5B66;&#x751F;&#x6570;&#x5B66;&#x5EFA;&#x6A21;&#x6BD4;&#x8D5B;&#x3002;&#x5728;&#x90A3;&#x77ED;&#x77ED;&#x7684;&#x4E00;&#x4E2A;&#x6708;&#x53C2;&#x8D5B;&#x51C6;&#x5907;&#x4EE5;&#x53CA;&#x56DB;&#x5929;&#x901A;&#x5BB5;&#x6BD4;&#x8D5B;&#x4E2D;&#xFF0C;&#x6211;&#x6240;&#x5B66;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#x4EE5;&#x53CA;&#x5B9E;&#x73B0;&#x7684;&#x7ED3;&#x679C;&#x8FDC;&#x8FDC;&#x5927;&#x4E8E;&#x4E4B;&#x524D;&#x4E00;&#x5E74;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x5E76;&#x548C;&#x6211;&#x7684;&#x961F;&#x53CB;&#x62FF;&#x5230;&#x4E86;&#x5F53;&#x5E74;Problem B&#x7684;Outstanding Winner&#x4EE5;&#x53CA;INFORMS Award&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4E86;&#x89E3;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x542F;&#x53D1;&#x5F0F;&#x7B97;&#x6CD5;&#xFF0C;&#x8BF8;&#x5982;&#x6A21;&#x62DF;&#x9000;&#x706B;&#x3001;&#x7C92;&#x5B50;&#x7FA4;&#x7B97;&#x6CD5;&#x3001;&#x8681;&#x7FA4;&#x7B97;&#x6CD5;&#x3001;&#x7981;&#x5FCC;&#x641C;&#x7D22;&#x3001;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x9057;&#x4F20;&#x7B97;&#x6CD5;&#x5BF9;&#x6211;&#x7684;&#x5F71;&#x54CD;&#x6700;&#x5927;&#x3002;&#x5F53;&#x6211;&#x5728;&#x6C42;&#x89E3;&#x65C5;&#x884C;&#x5546;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E74;&#x5C11;&#x65E0;&#x77E5;&#x7684;&#x6211;&#x5B8C;&#x5168;&#x88AB;&#x9057;&#x4F20;&#x7B97;&#x6CD5;&#x6F14;&#x5316;&#x51FA;&#x6765;&#x7684;&#x7B56;&#x7565;&#x89E3;&#x800C;&#x6298;&#x670D;&#xFF0C;&#x4EE5;&#x81F3;&#x540E;&#x6765;&#x9010;&#x6B65;&#x8DE8;&#x5165;&#x4E86;&#x590D;&#x6742;&#x81EA;&#x9002;&#x5E94;&#x7F51;&#x7EDC;&#x4EE5;&#x53CA;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x5751;&#x3002;&#x5165;&#x95E8;&#x4E66;&#x7C4D;&#x4FBF;&#x662F;&#x5E26;&#x6709;&#x79D1;&#x666E;&#x6027;&#x8D28;&#x8BB0;&#x5F55;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7B2C;&#x4E00;&#x6B21;&#x5CF0;&#x4F1A;<a href="https://en.wikipedia.org/wiki/Dartmouth_Conferences" target="_blank" rel="external">&#x8FBE;&#x7279;&#x77DB;&#x65AF;&#x4F1A;&#x8BAE;</a>&#x7684;<a href="https://book.douban.com/subject/1030898/" target="_blank" rel="external">&#x300A;&#x590D;&#x6742;&#x300B;</a>&#xFF0C; &#x9057;&#x4F20;&#x7B97;&#x6CD5;&#x4E4B;&#x7236;&#x7EA6;&#x7FF0;&#xB7;&#x970D;&#x5170;&#x5FB7;&#x7684;<a href="https://book.douban.com/subject/1071936/" target="_blank" rel="external">&#x300A;&#x9690;&#x79E9;&#x5E8F;&#xFF1A;&#x9002;&#x5E94;&#x6027;&#x9020;&#x5C31;&#x590D;&#x6742;&#x6027;&#x300B;</a> &#x4EE5;&#x53CA;&#x5927;&#x540D;&#x9F0E;&#x9F0E;&#x7684;<a href="https://book.douban.com/subject/1291204/" target="_blank" rel="external">&#x300A;&#x54E5;&#x5FB7;&#x5C14;&#x3001;&#x57C3;&#x820D;&#x5C14;&#x3001;&#x5DF4;&#x8D6B;&#xFF1A;&#x96C6;&#x5F02;&#x74A7;&#x4E4B;&#x5927;&#x6210;&#x300B;</a>&#x3002; &#x5C24;&#x5176;&#x662F;&#x6700;&#x540E;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x5BF9;&#x6211;&#x7684;&#x4E16;&#x754C;&#x89C2;&#x9020;&#x6210;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x51B2;&#x51FB;&#xFF0C;&#x8BF8;&#x5982;&#x81EA;&#x6307;&#x3001;&#x9012;&#x5F52;&#x4EE5;&#x53CA;&#x7CFB;&#x7EDF;&#x7684;&#x5C42;&#x6B21;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x53C2;&#x52A0;2013&#x5E74;&#x7684;&#x7F8E;&#x8D5B;&#xFF0C;&#x6211;&#x4F30;&#x8BA1;&#x4E0D;&#x4F1A;&#x5BF9;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4E0D;&#x4F1A;&#x6765;&#x8BFB;&#x535A;&#x58EB;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x6211;&#x4E0D;&#x4F1A;&#x53D1;&#x73B0; <code>&#x7F16;&#x7A0B;&#x5E26;&#x7ED9;&#x6211;&#x7684;&#x4E50;&#x8DA3;</code> &#x3002;
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">&#x4F60;&#x90FD;&#x5728;&#x4F7F;&#x7528;&#x54EA;&#x4E9B;&#x786C;&#x4EF6;&#xFF1F;</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">&#x8BA4;&#x77E5;&#x7684;&#x5EF6;&#x4F38;</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><b>Macbook Pro (Retina, 15-inch, Mid 2014)</b> &#xFF1A;&#x5C0F;&#x578B;&#x79FB;&#x52A8;&#x5DE5;&#x4F5C;&#x7AD9;&#xFF0C;&#x5904;&#x7406;&#x6211;&#x4E3B;&#x8981;&#x7684;&#x8BA1;&#x7B97;&#x4EE5;&#x53CA;&#x5199;&#x4F5C;&#x4EFB;&#x52A1;&#x3002;15&#x82F1;&#x5BF8;&#x7684;Retina&#x663E;&#x793A;&#x5C4F;&#xFF0C;&#x5904;&#x7406;&#x5206;&#x5C4F;&#x4EFB;&#x52A1;&#x7B80;&#x76F4;&#x4E0D;&#x8981;&#x592A;&#x723D;&#x3002;&#x518D;&#x8005;&#xFF0C;mac os&#x76F8;&#x5BF9;windows&#x7684;&#x6700;&#x5927;&#x597D;&#x5904;&#x5C31;&#x662F;&#x5B89;&#x9759;&#xFF0C;&#x4E0D;&#x4F1A;&#x968F;&#x4FBF;&#x8DF3;&#x51FA;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x63D0;&#x793A;&#xFF0C;&#x5168;&#x5C4F;&#x5904;&#x7406;&#x4EFB;&#x52A1;&#x4E5F;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x9AD8;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x7A0B;&#x5E8F;&#x5458;&#x975E;&#x5E38;&#x53CB;&#x5584;&#x3002;&#x552F;&#x4E00;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x5BF9;&#x6E38;&#x620F;&#x652F;&#x6301;&#x4E00;&#x822C;&#x5427;&#x3002;
</li>
<li><b>iPad Air (32G)</b> &#xFF1A;&#x5A31;&#x4E50;&#x4EE5;&#x53CA;&#x770B;&#x4E66;&#x5229;&#x5668;&#x3002;&#x6211;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x5F88;&#x5C11;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x6240;&#x4EE5;&#x57FA;&#x672C;&#x7684;&#x5A31;&#x4E50;&#x9760;iPad&#x4E5F;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x73A9;&#x73A9;&#x6E38;&#x620F;&#x3001;&#x770B;&#x770B;&#x5267;&#x3001;&#x542C;&#x542C;&#x97F3;&#x4E50;&#x4E4B;&#x7C7B;&#x7684;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;zotero-&gt;dropbox-&gt;good reader&#x8FD9;&#x4E00;&#x5957;&#x7684;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x6D41;&#xFF0C;&#x8BA9;&#x6211;&#x5728;iPad&#x4E0A;&#x770B;&#x4E86;&#x4E0D;&#x5C11;&#x4E66;&#xFF0C;&#x800C;&#x4E14;&#x57FA;&#x4E8E;&#x6211;&#x7684;&#x677E;&#x9F20;&#x75C7;&#xFF0C;&#x6240;&#x6709;&#x8D44;&#x6599;&#x88AB;&#x7535;&#x5B50;&#x5316;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x96BE;&#x80FD;&#x53EF;&#x8D35;&#x4E86;&#xFF01;&#x5C31;&#x662F;32G&#x7684;&#x5BB9;&#x91CF;&#x6709;&#x4E9B;&#x5C0F;&#x4E86;&#x3002;
</li>
<li><b>iPhone 6s (64G)</b> &#xFF1A;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;&#x8BB0;&#x5F55;&#x4E2D;&#x5FC3;&#x3002;&#x7EAF;&#x7CB9;&#x7684;&#x901A;&#x4FE1;&#x5DE5;&#x5177;&#x3001;&#x751F;&#x6D3B;&#x8BB0;&#x5F55;&#x5DE5;&#x5177;&#x3001;&#x65F6;&#x95F4;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x3001;&#x788E;&#x7247;&#x65F6;&#x95F4;&#x6253;&#x53D1;&#x5DE5;&#x5177;&#x4EE5;&#x53CA;&#x7761;&#x7720;&#x76D1;&#x6D4B;&#x5DE5;&#x5177;&#x3002;
</li>
<li><b>Apple Watch Nike+</b> &#xFF1A;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x6B3E;&#x8868;&#xFF0C;&#x66F4;&#x662F;&#x82F9;&#x679C;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E00;&#x5458;&#x3002;&#x89E3;&#x9501;Macbook&#xFF0C;&#x9065;&#x63A7;iTunes&#xFF0C;&#x8FDC;&#x7A0B;&#x63A7;&#x5236;iPhone&#x7684;&#x76F8;&#x673A;&#xFF0C;&#x63A5;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x7B49;&#x7B49;&#x7B49;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x6211;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8FD8;&#x662F;&#x5065;&#x5EB7;&#x4EE5;&#x53CA;&#x8FD0;&#x52A8;&#x8BB0;&#x5F55;&#xFF0C;&#x6BCF;&#x65E5;&#x5B8C;&#x6210;&#x4E09;&#x5706;&#x73AF;&#x76EE;&#x6807;&#xFF0C;&#x67E5;&#x770B;&#x9759;&#x606F;&#x8FD0;&#x52A8;&#x4EE5;&#x53CA;&#x7761;&#x7720;&#x5FC3;&#x7387;&#x3002;&#x53E6;&#x5916;&#x4F5C;&#x4E3A;&#x4E00;&#x6B3E;&#x8868;&#xFF0C;&#x5176;&#x65F6;&#x95F4;&#x65C5;&#x884C;&#x4EE5;&#x53CA;&#x63D0;&#x524D;&#x8868;&#x76D8;&#x65F6;&#x95F4;&#x529F;&#x80FD;&#x4E5F;&#x662F;&#x86EE;&#x8D5E;&#x7684;&#x3002;
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">&#x5473;&#x857E;&#x7684;&#x5EF6;&#x4F38;</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>&#x70E4;&#x7BB1;
</li>
<li>&#x7535;&#x538B;&#x9505;
</li>
<li>&#x5B9C;&#x5BB6;&#x9505;
</li>
<li>&#x6253;&#x86CB;&#x5668;
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">&#x8F6F;&#x4EF6;&#x5462;&#xFF1F;</h2>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">&#x4F60;&#x6700;&#x7406;&#x60F3;&#x7684;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h2>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">&#x4F60;&#x5E73;&#x65F6;&#x83B7;&#x5F97;&#x5DE5;&#x4F5C;&#x7075;&#x611F;&#x7684;&#x65B9;&#x5F0F;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;</h2>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">&#x63A8;&#x8350;&#x4E00;&#x4EF6;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x5229;&#x5668;&#x7ED9;&#x5927;&#x5BB6;&#x3002;</h2>
<div class="outline-text-2" id="text-7">
<blockquote>
<p>
&#x672C;&#x6587;&#x53C2;&#x4E0E;&#x4E86;&#x300C;&#x5229;&#x5668;&#x793E;&#x7FA4;&#x8BA1;&#x5212;&#x300D;&#xFF0C;&#x53D1;&#x73B0;&#x66F4;&#x591A;&#x521B;&#x9020;&#x8005;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x5177;&#xFF1A;<a href="http://liqi.io/community/" target="_blank" rel="external">http://liqi.io/community/</a>
</p>
</blockquote>
</div>
</div>

	</div>
        
        <!--Donate-->
          <style type="text/css">
            #rewardButton{cursor:pointer;border:0;outline:0;border-radius:100%;padding:0;margin:0;letter-spacing:normal;text-transform:none;text-indent:0px;text-shadow:none;}
            #rewardButton span{display:inline-block;width:80px;height:25px;border-radius:5px;color:#fff;font-weight:400;font-style:normal;font-variant:normal;font-stretch:normal;font-size:18px;font-family:"Microsoft Yahei";background:#f44336;}
            #rewardButton span:hover{background:#f7877f;}#QR{padding-top:20px;}#QR a{border:0;}#QR img{width:180px;max-width:100%;display:inline-block;margin:0.8em 2em 0 2em;}#wechat:hover p{animation:roll 0.1s infinite linear;-webkit-animation:roll 0.1s infinite linear;-moz-animation:roll 0.1s infinite linear;}#alipay:hover p{animation:roll 0.1s infinite linear;-webkit-animation:roll 0.1s infinite linear;-moz-animation:roll 0.1s infinite linear;}
            @-moz-keyframes roll{from{-webkit-transform:rotateZ(30deg);-moz-transform:rotateZ(30deg);-ms-transform:rotateZ(30deg);-o-transform:rotateZ(30deg);transform:rotateZ(30deg);}to{-webkit-transform:rotateZ(-30deg);-moz-transform:rotateZ(-30deg);-ms-transform:rotateZ(-30deg);-o-transform:rotateZ(-30deg);transform:rotateZ(-30deg);}}@-webkit-keyframes roll{from{-webkit-transform:rotateZ(30deg);-moz-transform:rotateZ(30deg);-ms-transform:rotateZ(30deg);-o-transform:rotateZ(30deg);transform:rotateZ(30deg);}to{-webkit-transform:rotateZ(-30deg);-moz-transform:rotateZ(-30deg);-ms-transform:rotateZ(-30deg);-o-transform:rotateZ(-30deg);transform:rotateZ(-30deg);}}@-o-keyframes roll{from{-webkit-transform:rotateZ(30deg);-moz-transform:rotateZ(30deg);-ms-transform:rotateZ(30deg);-o-transform:rotateZ(30deg);transform:rotateZ(30deg);}to{-webkit-transform:rotateZ(-30deg);-moz-transform:rotateZ(-30deg);-ms-transform:rotateZ(-30deg);-o-transform:rotateZ(-30deg);transform:rotateZ(-30deg);}}@keyframes roll{from{-webkit-transform:rotateZ(30deg);-moz-transform:rotateZ(30deg);-ms-transform:rotateZ(30deg);-o-transform:rotateZ(30deg);transform:rotateZ(30deg);}to{-webkit-transform:rotateZ(-30deg);-moz-transform:rotateZ(-30deg);-ms-transform:rotateZ(-30deg);-o-transform:rotateZ(-30deg);transform:rotateZ(-30deg);}}
        </style>
        
        <div>
          <div style="padding: 10px 0; margin: 20px auto; width: 90%; text-align: center;">
            <div>据说爱打赏的人运气都不会差</div>
            <button id="rewardButton" disable="enable" onclick="var qr = document.getElementById('QR'); if (qr.style.display === 'none') {qr.style.display='block';} else {qr.style.display='none'}">
              <span>谢主隆恩</span>
            </button>
            <div id="QR" style="display: none;">
              <div id="wechat" style="display: inline-block">
                <a href="" class="fancybox" rel="group"><img id="wechat_qr" src="/imgs/wechatpay.PNG"></a>
                <p>微信打赏</p>
              </div>
              <div id="wechat" style="display: inline-block">
                <a href="" class="fancybox" rel="group"><img id="alipay_qr" src="/imgs/alipay.PNG"></a>
                <p>支付宝打赏</p>
              </div>              
            </div>
          </div>
        </div>
        <!--End of Donate-->


	<div>
  	<center>
	<div class="pagination">
<ul class="pagination">
	 
		
          <li class="prev disabled"><a><i class="fa fa-arrow-circle-o-left"></i>上一页</a></li>
        

        <li><a href="/"><i class="fa fa-archive"></i>首页</a></li>

		
		   <li class="next"><a href="/2016/03/12/CF-598D/" class="alignright next">下一页<i class="fa fa-arrow-circle-o-right"></i></a></li>         
        
	
</ul>
</div>

    </center>
	</div>

    <!-- share -->
    
        
    <div class="bdsharebuttonbox">
        <a href="#" class="bds_more" data-cmd="more"></a>
        <a href="#" class="bds_weixin" data-cmd="weixin" title="分享到微信"></a>
        <a href="#" class="bds_tsina" data-cmd="tsina" title="分享到新浪微博"></a>
        <a href="#" class="bds_fbook" data-cmd="fbook" title="分享到Facebook"></a>
        <a href="#" class="bds_twi" data-cmd="twi" title="分享到Twitter"></a>
        <a href="#" class="bds_linkedin" data-cmd="linkedin" title="分享到linkedin"></a>
        <a href="#" class="bds_evernotecn" data-cmd="evernotecn" title="分享到印象笔记"></a>
        <a href="#" class="bds_youdao" data-cmd="youdao" title="分享到有道云笔记"></a>
        <a href="#" class="bds_copy" data-cmd="copy" title="分享到复制网址"></a>
    </div>
    <script>
        window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"2","bdMiniList":false,"bdPic":"","bdStyle":"1","bdSize":"24"},"share":{}};
        with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];
    </script>


        

    
	
	<!-- comment -->
	
<section id="comment">
  <h2 class="title">留言</h2>

  
  	 <div class="ds-thread" data-thread-key="2016/12/03/my_liqi/" data-title="工欲善其事，必先利其器" data-url="http://blog.greenwicher.com/2016/12/03/my_liqi/"></div>  
  
</section>

	</div> <!-- col-md-9/col-md-12 -->
		
	
	<div id="side_meta">
           <span id="busuanzi_container_page_pv">
             新大陆被发现了<span id="busuanzi_value_page_pv" class="badge badge-success"></span>次！
          </span>

		<div class="col-md-3" id="post_meta"> 

	<!-- date -->
	
	<div class="meta-widget">
	<i class="fa fa-clock-o"></i>
	Dec 3 2016 
	</div>
	

	<!-- categories -->
    
	<div class="meta-widget">
	<a data-toggle="collapse" data-target="#categorys"><i class="fa fa-folder"></i></a>	
    <ul id="categorys" class="tag_box list-unstyled collapse in">
          
  <li>
    <li><a href="/categories/杂/">杂<span>2</span></a></li>
  </li>

    </ul>
	</div>
	

	<!-- tags -->
	
	<div class="meta-widget">
	<a data-toggle="collapse" data-target="#tags"><i class="fa fa-tags"></i></a>		  
    <ul id="tags" class="tag_box list-unstyled collapse in">	  
	    
  <li><a href="/tags/工作流/">工作流<span>1</span></a></li> <li><a href="/tags/工具库/">工具库<span>1</span></a></li> <li><a href="/tags/推荐/">推荐<span>1</span></a></li>
    </ul>
	</div>
		

	<!-- toc -->
	<div class="meta-widget" style="top: 200px; right: 10px; position: fixed !important;">
	
	   <a data-toggle="collapse" data-target="#toc"><i class="fa fa-bars"></i></a>
	   <div id="toc" class="toc collapse in">
			<ol class="toc-article"><li class="toc-article-item toc-article-level-2"><a class="toc-article-link" href="#sec-1"><span class="toc-article-text">介绍一下你自己和所做的工作。</span></a></li><li class="toc-article-item toc-article-level-2"><a class="toc-article-link" href="#sec-2"><span class="toc-article-text">你的职业生涯的转折点是什么？</span></a></li><li class="toc-article-item toc-article-level-2"><a class="toc-article-link" href="#sec-3"><span class="toc-article-text">你都在使用哪些硬件？</span></a><ol class="toc-article-child"><li class="toc-article-item toc-article-level-3"><a class="toc-article-link" href="#sec-3-1"><span class="toc-article-text">认知的延伸</span></a></li><li class="toc-article-item toc-article-level-3"><a class="toc-article-link" href="#sec-3-2"><span class="toc-article-text">味蕾的延伸</span></a></li></ol></li><li class="toc-article-item toc-article-level-2"><a class="toc-article-link" href="#sec-4"><span class="toc-article-text">软件呢？</span></a></li><li class="toc-article-item toc-article-level-2"><a class="toc-article-link" href="#sec-5"><span class="toc-article-text">你最理想的工作环境是什么？</span></a></li><li class="toc-article-item toc-article-level-2"><a class="toc-article-link" href="#sec-6"><span class="toc-article-text">你平时获得工作灵感的方式有哪些？</span></a></li><li class="toc-article-item toc-article-level-2"><a class="toc-article-link" href="#sec-7"><span class="toc-article-text">推荐一件生活中的利器给大家。</span></a></li></ol>
		</div>
	
	</div>
	
    <hr>
	
</div><!-- col-md-3 -->

	</div>
		

</div><!-- row -->

<script type="text/javascript">
  var duoshuoQuery = { short_name: 'greenwicher' };
  (function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';
    ds.async = true;
    ds.src = 'http://static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
</script>





	</div>
  </div>
  <div class="container-narrow">
  <footer> <p>
  &copy; 2016 LIU Weizhi
  
      with help from <a href="http://hexo.io/" target="_blank">Hexo</a> and <a href="http://getbootstrap.com/" target="_blank">Twitter Bootstrap</a>. Theme by <a href="http://github.com/wzpan/hexo-theme-freemind/">Freemind</a>.
</br>
本站共迎来了<span id="busuanzi_value_site_uv"></span>个小伙伴，总计<span id="busuanzi_value_site_pv"></span>次站点流量.

</p>

<script async src="//dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js">
</script>
 </footer>
</div> <!-- container-narrow -->
  


  
<a id="gotop" href="#">   
  <span>▲</span> 
</a>

<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/bootstrap.min.js"></script>
<script src="/js/main.js"></script>
<script src="/js/search.js"></script> 


<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();
})(jQuery);
</script>



   <script type="text/javascript">      
     var search_path = "search.xml";
	 if (search_path.length == 0) {
	 	search_path = "search.xml";
	 }
	 var path = "/" + search_path;
     searchFunc(path, 'local-search-input', 'local-search-result');
   </script>

<script type="text/x-mathjax-config">
    MathJax.Hub.Config({
        tex2jax: {
            inlineMath: [ ["$","$"], ["\\(","\\)"] ],
            skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code'],
            processEscapes: true
        }
    });
    MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax();
        for (var i = 0; i < all.length; ++i)
            all[i].SourceElement().parentNode.className += ' has-jax';
    });
</script>
<script src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
</body>
   </html>
